---
title: ExternalFileUtils
classe: Autodesk.Revit.DB.ExternalFileUtils
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# ExternalFileUtils

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ICollection<ElementId> GetAllExternalFileReferences(Document)` | `ExternalFileUtils.GetAllExternalFileReferences(aDoc)` | ICollection<ElementId> |
| `ExternalFileReference GetExternalFileReference(Document, ElementId)` | `ExternalFileUtils.GetExternalFileReference(aDoc, elemId)` | ExternalFileReference |
| `String GetFileBasedTempFolder(String)` | `ExternalFileUtils.GetFileBasedTempFolder(filename)` | String |
| `Boolean IsExternalFileReference(Document, ElementId)` | `ExternalFileUtils.IsExternalFileReference(aDoc, elemId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```